//OPENSSL 0.98

//////////////////////////////////////////證書申請者信息開始//////////////////////////

//說明:
//TOTAL - 總共條目數量
//IsDisp - 條目是否顯示在界面中 0 - 不顯示; 1 - 顯示
//InsideName - 内部名稱 根据RFC 3383制定
//DispName - 顯示在程序界面中的名稱
//Info - 内容
//IsCheck - 條目是否選中 0 - 未選中;  1 - 選中


[TOTAL]
ToTal=16

[INFO1]
IsDisp=1
InsideName=CN
DispName=名稱
Info=MiniCA
IsCheck=1

[INFO2]
IsDisp=1
InsideName=C
DispName=國家
Info=中國
IsCheck=1

[INFO3]
IsDisp=1
InsideName=ST
DispName=省份
Info=河北
IsCheck=1

[INFO4]
IsDisp=1
InsideName=L
DispName=城市
Info=石家莊
IsCheck=1

[INFO5]
IsDisp=1
InsideName=O
DispName=組織
Info=MiniSoft
IsCheck=1

[INFO6]
IsDisp=1
InsideName=OU
DispName=單位
Info=MiniCA
IsCheck=1

[INFO7]
IsDisp=1
InsideName=emailAddress
DispName=電子郵件
Info=hpxs@hotmail.com
IsCheck=1

[INFO8]
IsDisp=0
InsideName=title
DispName=頭銜
Info=title
IsCheck=1

[INFO9]
IsDisp=0
InsideName=givenName
DispName=曾用名
Info=givenName
IsCheck=1

[INFO10]
IsDisp=1
InsideName=SN
DispName=姓氏
Info=SN
IsCheck=1

[INFO11]
IsDisp=1
InsideName=2.5.4.20
DispName=固定電話
Info=8888-8888888
IsCheck=1

[INFO12]
IsDisp=1
InsideName=2.5.4.9
DispName=街道
Info=金光大道88號
IsCheck=1

[INFO13]
IsDisp=1
InsideName=2.5.4.18
DispName=郵政信箱
Info=888888信箱
IsCheck=1

[INFO14]
IsDisp=1
InsideName=2.5.4.17
DispName=郵政編碼
Info=888888
IsCheck=1

[INFO15]
IsDisp=1
InsideName=0.9.2342.19200300.100.1.1
DispName=身份證號碼
Info=13020319770306****
IsCheck=1

[INFO16]
IsDisp=1
InsideName=0.9.2342.19200300.100.1.41
DispName=移動電話
Info=13810914***
IsCheck=1

//////////////////////////////////////////證書申請者信息結束//////////////////////////


[CA]
C = 中國
ST = 河北
L = 石家莊
O = MiniSoft
OU = MiniCA
CN = MiniCA
T = MiniCA
G = MiniCA
S = MiniCA
EMAIL = hpxs@hotmail.com
RSALEN = 2048
DAY = 365
SN =2
KEYPWD = MiniCA

[CRL]
Revoke = 1,2,3,4,5

[PATH]
Cert =
